#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


module.github.github_repository.repository["zerotier"]: Refreshing state... [id=k8s-zerotier]
module.github.github_repository.example: Refreshing state... [id=terraform-example]
module.synology.module.minio.minio_s3_bucket.bucket["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_iam_user.user["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211110222252090600000001]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211110222252184500000004]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211110222252184400000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211110222252147500000002]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["reality"]: Refreshing state... [id=config/e4:5f:01:27:b9:6a.yaml]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["mind"]: Refreshing state... [id=config/e4:5f:01:27:c8:af.yaml]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["soul"]: Refreshing state... [id=config/e4:5f:01:05:41:72.yaml]
module.kubernetes.module.infinity-gauntlet.module.namespaces.kubernetes_namespace.namespace["terraform"]: Refreshing state... [id=terraform]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.kubernetes_namespace.namespace: Refreshing state... [id=longhorn-system]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_s3_bucket.bucket: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.kubernetes.module.infinity-gauntlet.module.services.module.default-backend.helm_release.default-backend: Refreshing state... [id=default-backend]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_user.user: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.kubernetes.module.infinity-gauntlet.module.services.module.unifi-poller.helm_release.unifi-poller: Refreshing state... [id=unifi-poller]
module.kubernetes.module.infinity-gauntlet.module.services.module.home-assistant.helm_release.home-assistant: Refreshing state... [id=home-assistant]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_policy.policy: Refreshing state... [id=state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80]
module.kubernetes.module.infinity-gauntlet.module.services.module.chaoskube.helm_release.chaoskube: Refreshing state... [id=chaoskube]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_policy.policy_global: Refreshing state... [id=state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_user_policy_attachment.policy_attachment: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211110222252604000000006]
module.kubernetes.module.infinity-gauntlet.module.services.module.cert-manager.helm_release.cert-manager: Refreshing state... [id=cert-manager]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_user_policy_attachment.policy_attachment_global: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211110222252578300000005]
module.kubernetes.module.infinity-gauntlet.module.services.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.kubernetes_secret.minio_credentials_secret: Refreshing state... [id=longhorn-system/minio-credentials]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.helm_release.longhorn: Refreshing state... [id=longhorn]
module.kubernetes.module.digitalocean-ams3.module.applications.kubernetes_namespace.namespace["zerotier"]: Refreshing state... [id=zerotier]
module.kubernetes.module.digitalocean-ams3.module.applications.kubernetes_service_account.service_account["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.digitalocean-ams3.module.applications.kubernetes_role.role["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.digitalocean-ams3.module.applications.kubernetes_role_binding.role_binding["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.digitalocean-ams3.module.applications.github_actions_secret.deployment-kubeconfig["zerotier"]: Refreshing state... [id=k8s-zerotier:DIGITALOCEAN_AMS3_KUBECONFIG]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_namespace.namespace: Refreshing state... [id=actions-runner-system]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_secret.controller_authentication_configuration: Refreshing state... [id=actions-runner-system/controller-manager]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.helm_release.github-actions-runner-controller: Refreshing state... [id=actions-runner-controller]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.kubernetes_namespace.namespace: Refreshing state... [id=pi-hole-exporter]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.kubernetes_secret.configuration: Refreshing state... [id=pi-hole-exporter/pi-hole]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.helm_release.pi-hole-exporter: Refreshing state... [id=pi-hole-exporter]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["zerotier"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["tf"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["tf"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["zerotier"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_namespace.namespace["zerotier"]: Refreshing state... [id=zerotier]
module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_service_account.service_account["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_role.role["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_role_binding.role_binding["zerotier"]: Refreshing state... [id=zerotier/zerotier-helm]
module.kubernetes.module.infinity-gauntlet.module.applications.github_actions_secret.deployment-kubeconfig["zerotier"]: Refreshing state... [id=k8s-zerotier:INFINITY_GAUNTLET_KUBECONFIG]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_policy.policy_global has been changed
  ~ resource "minio_iam_policy" "policy_global" {
        id     = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b"
        name   = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:ListAllMyBuckets",
                            "s3:GetBucketLocation",
                          + "s3:ListAllMyBuckets",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_policy" "policy" {
        id     = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc"
        name   = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-etcd/*",
                            "arn:aws:s3:::state-infinity-gauntlet-etcd",
                          + "arn:aws:s3:::state-infinity-gauntlet-etcd/*",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"] has been changed
  ~ resource "minio_iam_policy" "policy" {
        id     = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7"
        name   = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::tftp-netboot-infinity-gauntlet",
                            "arn:aws:s3:::tftp-netboot-infinity-gauntlet/*",
                          + "arn:aws:s3:::tftp-netboot-infinity-gauntlet",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "tftp-netboot-infinity-gauntlet-20211110222252090600000001"
      ~ policy_name = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" -> "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
        id          = "state-infinity-gauntlet-etcd-20211110222252147500000002"
      ~ policy_name = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" -> "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc"
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.github.github_repository.example will be updated in-place
  ~ resource "github_repository" "example" {
      ~ description            = "My awesome terraform example 856c5454d5e208d258895ba7e2b9c1b2" -> (known after apply)
        id                     = "terraform-example"
        name                   = "terraform-example"
        # (27 unchanged attributes hidden)
    }

  # module.github.github_repository.repository["terraform"] will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "terraform"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = true
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.synology.module.minio.data.minio_iam_policy_document.policy_document["state_infinity_gauntlet_etcd"] will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_document"  {
      ~ id      = "3337559422" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-etcd/*",
                          - "arn:aws:s3:::state-infinity-gauntlet-etcd",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.synology.module.minio.data.minio_iam_policy_document.policy_document["tftp_netboot_infinity_gauntlet"] will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_document"  {
      ~ id      = "718304209" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::tftp-netboot-infinity-gauntlet/*",
                          - "arn:aws:s3:::tftp-netboot-infinity-gauntlet",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.synology.module.minio.data.minio_iam_policy_document.policy_global_document["state_infinity_gauntlet_etcd"] will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_global_document"  {
      ~ id      = "2744573621" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.synology.module.minio.data.minio_iam_policy_document.policy_global_document["tftp_netboot_infinity_gauntlet"] will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_global_document"  {
      ~ id      = "2744573621" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_policy" "policy" {
      ~ id     = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-etcd",
                          - "arn:aws:s3:::state-infinity-gauntlet-etcd/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_policy" "policy" {
      ~ id     = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" -> (known after apply)
      ~ name   = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::tftp-netboot-infinity-gauntlet/*",
                          - "arn:aws:s3:::tftp-netboot-infinity-gauntlet",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_policy" "policy_global" {
      ~ id     = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetBucketLocation",
                          - "s3:ListAllMyBuckets",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_policy" "policy_global" {
      ~ id     = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply)
      ~ name   = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetBucketLocation",
                          - "s3:ListAllMyBuckets",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-etcd-20211110222252184500000004" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "tftp-netboot-infinity-gauntlet-20211110222252090600000001" -> (known after apply)
      ~ policy_name = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "state-infinity-gauntlet-etcd-20211110222252147500000002" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "tftp-netboot-infinity-gauntlet-20211110222252184400000003" -> (known after apply)
      ~ policy_name = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes.module.digitalocean-ams3.module.applications.data.kubernetes_secret.token["zerotier"] will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "token"  {
      ~ data      = (sensitive value)
      ~ id        = "zerotier/zerotier-helm-token-svb8d" -> (known after apply)
      ~ immutable = false -> (known after apply)
      ~ type      = "kubernetes.io/service-account-token" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "zerotier-helm-token-svb8d"
          ~ resource_version = "271688784" -> (known after apply)
          ~ uid              = "d2285f74-fb21-411d-8c9c-ca3d64711590" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.kubernetes.module.digitalocean-ams3.module.applications.github_actions_secret.deployment-kubeconfig["zerotier"] must be replaced
-/+ resource "github_actions_secret" "deployment-kubeconfig" {
      ~ created_at      = "2021-11-10 22:22:53 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "k8s-zerotier:DIGITALOCEAN_AMS3_KUBECONFIG" -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2021-11-10 22:22:53 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.applications.data.kubernetes_secret.token["terraform"] will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "token"  {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "terraform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.applications.data.kubernetes_secret.token["zerotier"] will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "token"  {
      ~ data      = (sensitive value)
      ~ id        = "zerotier/zerotier-helm-token-c6ntt" -> (known after apply)
      ~ immutable = false -> (known after apply)
      ~ type      = "kubernetes.io/service-account-token" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "zerotier-helm-token-c6ntt"
          ~ resource_version = "35346" -> (known after apply)
          ~ uid              = "71f78158-0acc-49f3-bfb3-e47357fc9e3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.applications.github_actions_secret.deployment-kubeconfig["terraform"] will be created
  + resource "github_actions_secret" "deployment-kubeconfig" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "terraform"
      + secret_name     = "INFINITY_GAUNTLET_KUBECONFIG"
      + updated_at      = (known after apply)
    }

  # module.kubernetes.module.infinity-gauntlet.module.applications.github_actions_secret.deployment-kubeconfig["zerotier"] must be replaced
-/+ resource "github_actions_secret" "deployment-kubeconfig" {
      ~ created_at      = "2021-11-10 22:22:55 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "k8s-zerotier:INFINITY_GAUNTLET_KUBECONFIG" -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2021-11-10 22:22:55 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_namespace.namespace["terraform"] will be created
  + resource "kubernetes_namespace" "namespace" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "wyrihaximus.net/application" = "terraform"
            }
          + name             = "terraform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_role.role["terraform"] will be created
  + resource "kubernetes_role" "role" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "wyrihaximus.net/application" = "terraform"
            }
          + name             = "terraform-helm"
          + namespace        = "terraform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "*",
            ]
          + verbs      = [
              + "*",
            ]
        }
      + rule {
          + api_groups = [
              + "*",
            ]
          + resources  = [
              + "*",
            ]
          + verbs      = [
              + "*",
            ]
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_role_binding.role_binding["terraform"] will be created
  + resource "kubernetes_role_binding" "role_binding" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "wyrihaximus.net/application" = "terraform"
            }
          + name             = "terraform-helm"
          + namespace        = "terraform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "terraform-helm"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "terraform-helm"
          + namespace = "terraform"
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.applications.kubernetes_service_account.service_account["terraform"] will be created
  + resource "kubernetes_service_account" "service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "wyrihaximus.net/application" = "terraform"
            }
          + name             = "terraform-helm"
          + namespace        = "terraform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["terraform"] will be created
  + resource "kubernetes_manifest" "runner_deployment" {
      + manifest = {
          + apiVersion = "actions.summerwind.dev/v1alpha1"
          + kind       = "RunnerDeployment"
          + metadata   = {
              + labels    = {
                  + repository = "terraform"
                  + type       = "user"
                  + user       = "wyrihaximus"
                }
              + name      = "runner-wyrihaximus-terraform"
              + namespace = "terraform"
            }
          + spec       = {
              + template = {
                  + metadata = {
                      + labels = {
                          + github.com/login      = "wyrihaximus"
                          + github.com/repository = "terraform"
                          + purpose               = "github-actions-workflow-runner"
                        }
                    }
                  + spec     = {
                      + affinity                  = {
                          + podAntiAffinity = {
                              + requiredDuringSchedulingIgnoredDuringExecution = [
                                  + {
                                      + labelSelector = {
                                          + matchExpressions = [
                                              + {
                                                  + key      = "purpose"
                                                  + operator = "In"
                                                  + values   = [
                                                      + "github-actions-workflow-runner",
                                                    ]
                                                },
                                            ]
                                        }
                                      + topologyKey   = "kubernetes.io/hostname"
                                    },
                                ]
                            }
                        }
                      + dockerdContainerResources = {
                          + limits   = {
                              + cpu    = "500m"
                              + memory = "2Gi"
                            }
                          + requests = {
                              + cpu    = "500m"
                              + memory = "2Gi"
                            }
                        }
                      + labels                    = [
                          + "infinity-gauntlet",
                          + "INFINITY_GAUNTLET",
                        ]
                      + repository                = "wyrihaximus/terraform"
                      + resources                 = {
                          + limits   = {
                              + cpu    = "1500m"
                              + memory = "2Gi"
                            }
                          + requests = {
                              + cpu    = "1500m"
                              + memory = "2Gi"
                            }
                        }
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "actions.summerwind.dev/v1alpha1"
          + kind       = "RunnerDeployment"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "runner-wyrihaximus-terraform"
              + namespace                  = "terraform"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + replicas = (known after apply)
              + selector = {
                  + matchExpressions = (known after apply)
                  + matchLabels      = (known after apply)
                }
              + template = {
                  + metadata = {
                      + annotations = (known after apply)
                      + finalizers  = (known after apply)
                      + labels      = {
                          + "github.com/login"      = "wyrihaximus"
                          + "github.com/repository" = "terraform"
                          + "purpose"               = "github-actions-workflow-runner"
                        }
                      + name        = (known after apply)
                      + namespace   = (known after apply)
                    }
                  + spec     = {
                      + affinity                      = {
                          + nodeAffinity    = {
                              + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                              + requiredDuringSchedulingIgnoredDuringExecution  = {
                                  + nodeSelectorTerms = (known after apply)
                                }
                            }
                          + podAffinity     = {
                              + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                              + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
                          + podAntiAffinity = {
                              + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                              + requiredDuringSchedulingIgnoredDuringExecution  = [
                                  + {
                                      + labelSelector     = {
                                          + matchExpressions = [
                                              + {
                                                  + key      = "purpose"
                                                  + operator = "In"
                                                  + values   = [
                                                      + "github-actions-workflow-runner",
                                                    ]
                                                },
                                            ]
                                          + matchLabels      = (known after apply)
                                        }
                                      + namespaceSelector = {
                                          + matchExpressions = (known after apply)
                                          + matchLabels      = (known after apply)
                                        }
                                      + namespaces        = (known after apply)
                                      + topologyKey       = "kubernetes.io/hostname"
                                    },
                                ]
                            }
                        }
                      + automountServiceAccountToken  = (known after apply)
                      + containers                    = (known after apply)
                      + dnsConfig                     = (known after apply)
                      + dockerEnabled                 = (known after apply)
                      + dockerMTU                     = (known after apply)
                      + dockerRegistryMirror          = (known after apply)
                      + dockerVolumeMounts            = (known after apply)
                      + dockerdContainerResources     = {
                          + limits   = {
                              + "cpu"    = "500m"
                              + "memory" = "2Gi"
                            }
                          + requests = {
                              + "cpu"    = "500m"
                              + "memory" = "2Gi"
                            }
                        }
                      + dockerdWithinRunnerContainer  = (known after apply)
                      + enableServiceLinks            = (known after apply)
                      + enterprise                    = (known after apply)
                      + env                           = (known after apply)
                      + envFrom                       = (known after apply)
                      + ephemeral                     = (known after apply)
                      + ephemeralContainers           = (known after apply)
                      + group                         = (known after apply)
                      + hostAliases                   = (known after apply)
                      + image                         = (known after apply)
                      + imagePullPolicy               = (known after apply)
                      + imagePullSecrets              = (known after apply)
                      + initContainers                = (known after apply)
                      + labels                        = [
                          + "infinity-gauntlet",
                          + "INFINITY_GAUNTLET",
                        ]
                      + nodeSelector                  = (known after apply)
                      + organization                  = (known after apply)
                      + repository                    = "wyrihaximus/terraform"
                      + resources                     = {
                          + limits   = {
                              + "cpu"    = "1500m"
                              + "memory" = "2Gi"
                            }
                          + requests = {
                              + "cpu"    = "1500m"
                              + "memory" = "2Gi"
                            }
                        }
                      + runtimeClassName              = (known after apply)
                      + securityContext               = {
                          + fsGroup             = (known after apply)
                          + fsGroupChangePolicy = (known after apply)
                          + runAsGroup          = (known after apply)
                          + runAsNonRoot        = (known after apply)
                          + runAsUser           = (known after apply)
                          + seLinuxOptions      = {
                              + level = (known after apply)
                              + role  = (known after apply)
                              + type  = (known after apply)
                              + user  = (known after apply)
                            }
                          + seccompProfile      = {
                              + localhostProfile = (known after apply)
                              + type             = (known after apply)
                            }
                          + supplementalGroups  = (known after apply)
                          + sysctls             = (known after apply)
                          + windowsOptions      = {
                              + gmsaCredentialSpec     = (known after apply)
                              + gmsaCredentialSpecName = (known after apply)
                              + runAsUserName          = (known after apply)
                            }
                        }
                      + serviceAccountName            = (known after apply)
                      + sidecarContainers             = (known after apply)
                      + terminationGracePeriodSeconds = (known after apply)
                      + tolerations                   = (known after apply)
                      + volumeMounts                  = (known after apply)
                      + volumeSizeLimit               = (known after apply)
                      + volumeStorageMedium           = (known after apply)
                      + volumes                       = (known after apply)
                      + workDir                       = (known after apply)
                    }
                }
            }
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["tf"] will be destroyed
  - resource "kubernetes_manifest" "runner_deployment" {
      - manifest = {
          - apiVersion = "actions.summerwind.dev/v1alpha1"
          - kind       = "RunnerDeployment"
          - metadata   = {
              - labels    = {
                  - repository = "terraform"
                  - type       = "user"
                  - user       = "wyrihaximus"
                }
              - name      = "runner-wyrihaximus-terraform"
              - namespace = "terraform"
            }
          - spec       = {
              - template = {
                  - metadata = {
                      - labels = {
                          - github.com/login      = "wyrihaximus"
                          - github.com/repository = "terraform"
                          - purpose               = "github-actions-workflow-runner"
                        }
                    }
                  - spec     = {
                      - affinity                  = {
                          - podAntiAffinity = {
                              - requiredDuringSchedulingIgnoredDuringExecution = [
                                  - {
                                      - labelSelector = {
                                          - matchExpressions = [
                                              - {
                                                  - key      = "purpose"
                                                  - operator = "In"
                                                  - values   = [
                                                      - "github-actions-workflow-runner",
                                                    ]
                                                },
                                            ]
                                        }
                                      - topologyKey   = "kubernetes.io/hostname"
                                    },
                                ]
                            }
                        }
                      - dockerdContainerResources = {
                          - limits   = {
                              - cpu    = "500m"
                              - memory = "2Gi"
                            }
                          - requests = {
                              - cpu    = "500m"
                              - memory = "2Gi"
                            }
                        }
                      - labels                    = [
                          - "infinity-gauntlet",
                          - "INFINITY_GAUNTLET",
                        ]
                      - repository                = "wyrihaximus/terraform"
                      - resources                 = {
                          - limits   = {
                              - cpu    = "1500m"
                              - memory = "2Gi"
                            }
                          - requests = {
                              - cpu    = "1500m"
                              - memory = "2Gi"
                            }
                        }
                    }
                }
            }
        } -> null
      - object   = {
          - apiVersion = "actions.summerwind.dev/v1alpha1"
          - kind       = "RunnerDeployment"
          - metadata   = {
              - annotations                = null
              - clusterName                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = {
                  - "repository" = "terraform"
                  - "type"       = "user"
                  - "user"       = "wyrihaximus"
                }
              - managedFields              = null
              - name                       = "runner-wyrihaximus-terraform"
              - namespace                  = "terraform"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - spec       = {
              - replicas = 1
              - selector = {
                  - matchExpressions = null
                  - matchLabels      = null
                }
              - template = {
                  - metadata = {
                      - annotations = null
                      - finalizers  = null
                      - labels      = {
                          - "github.com/login"      = "wyrihaximus"
                          - "github.com/repository" = "terraform"
                          - "purpose"               = "github-actions-workflow-runner"
                        }
                      - name        = null
                      - namespace   = null
                    }
                  - spec     = {
                      - affinity                      = {
                          - nodeAffinity    = {
                              - preferredDuringSchedulingIgnoredDuringExecution = null
                              - requiredDuringSchedulingIgnoredDuringExecution  = {
                                  - nodeSelectorTerms = null
                                }
                            }
                          - podAffinity     = {
                              - preferredDuringSchedulingIgnoredDuringExecution = null
                              - requiredDuringSchedulingIgnoredDuringExecution  = null
                            }
                          - podAntiAffinity = {
                              - preferredDuringSchedulingIgnoredDuringExecution = null
                              - requiredDuringSchedulingIgnoredDuringExecution  = [
                                  - {
                                      - labelSelector     = {
                                          - matchExpressions = [
                                              - {
                                                  - key      = "purpose"
                                                  - operator = "In"
                                                  - values   = [
                                                      - "github-actions-workflow-runner",
                                                    ]
                                                },
                                            ]
                                          - matchLabels      = null
                                        }
                                      - namespaceSelector = {
                                          - matchExpressions = null
                                          - matchLabels      = null
                                        }
                                      - namespaces        = null
                                      - topologyKey       = "kubernetes.io/hostname"
                                    },
                                ]
                            }
                        }
                      - automountServiceAccountToken  = null
                      - containers                    = null
                      - dnsConfig                     = null
                      - dockerEnabled                 = null
                      - dockerMTU                     = null
                      - dockerRegistryMirror          = null
                      - dockerVolumeMounts            = null
                      - dockerdContainerResources     = {
                          - limits   = {
                              - "cpu"    = "500m"
                              - "memory" = "2Gi"
                            }
                          - requests = {
                              - "cpu"    = "500m"
                              - "memory" = "2Gi"
                            }
                        }
                      - dockerdWithinRunnerContainer  = null
                      - enableServiceLinks            = null
                      - enterprise                    = null
                      - env                           = null
                      - envFrom                       = null
                      - ephemeral                     = null
                      - ephemeralContainers           = null
                      - group                         = null
                      - hostAliases                   = null
                      - image                         = ""
                      - imagePullPolicy               = null
                      - imagePullSecrets              = null
                      - initContainers                = null
                      - labels                        = [
                          - "infinity-gauntlet",
                          - "INFINITY_GAUNTLET",
                        ]
                      - nodeSelector                  = null
                      - organization                  = null
                      - repository                    = "wyrihaximus/terraform"
                      - resources                     = {
                          - limits   = {
                              - "cpu"    = "1500m"
                              - "memory" = "2Gi"
                            }
                          - requests = {
                              - "cpu"    = "1500m"
                              - "memory" = "2Gi"
                            }
                        }
                      - runtimeClassName              = null
                      - securityContext               = {
                          - fsGroup             = null
                          - fsGroupChangePolicy = null
                          - runAsGroup          = null
                          - runAsNonRoot        = null
                          - runAsUser           = null
                          - seLinuxOptions      = {
                              - level = null
                              - role  = null
                              - type  = null
                              - user  = null
                            }
                          - seccompProfile      = {
                              - localhostProfile = null
                              - type             = null
                            }
                          - supplementalGroups  = null
                          - sysctls             = null
                          - windowsOptions      = {
                              - gmsaCredentialSpec     = null
                              - gmsaCredentialSpecName = null
                              - runAsUserName          = null
                            }
                        }
                      - serviceAccountName            = null
                      - sidecarContainers             = null
                      - terminationGracePeriodSeconds = null
                      - tolerations                   = null
                      - volumeMounts                  = null
                      - volumeSizeLimit               = null
                      - volumeStorageMedium           = null
                      - volumes                       = null
                      - workDir                       = null
                    }
                }
            }
        } -> null
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["terraform"] will be created
  + resource "kubernetes_manifest" "runner_deployment_autoscaler" {
      + manifest = {
          + apiVersion = "actions.summerwind.dev/v1alpha1"
          + kind       = "HorizontalRunnerAutoscaler"
          + metadata   = {
              + labels    = {
                  + repository = "terraform"
                  + type       = "user"
                  + user       = "wyrihaximus"
                }
              + name      = "runner-wyrihaximus-terraform"
              + namespace = "terraform"
            }
          + spec       = {
              + maxReplicas                        = 1
              + metrics                            = [
                  + {
                      + repositoryNames = [
                          + "wyrihaximus/terraform",
                        ]
                      + type            = "TotalNumberOfQueuedAndInProgressWorkflowRuns"
                    },
                ]
              + minReplicas                        = 0
              + scaleDownDelaySecondsAfterScaleOut = 3600
              + scaleTargetRef                     = {
                  + name = "runner-wyrihaximus-terraform"
                }
            }
        }
      + object   = {
          + apiVersion = "actions.summerwind.dev/v1alpha1"
          + kind       = "HorizontalRunnerAutoscaler"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "runner-wyrihaximus-terraform"
              + namespace                  = "terraform"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + capacityReservations               = (known after apply)
              + maxReplicas                        = 1
              + metrics                            = [
                  + {
                      + repositoryNames     = [
                          + "wyrihaximus/terraform",
                        ]
                      + scaleDownAdjustment = (known after apply)
                      + scaleDownFactor     = (known after apply)
                      + scaleDownThreshold  = (known after apply)
                      + scaleUpAdjustment   = (known after apply)
                      + scaleUpFactor       = (known after apply)
                      + scaleUpThreshold    = (known after apply)
                      + type                = "TotalNumberOfQueuedAndInProgressWorkflowRuns"
                    },
                ]
              + minReplicas                        = 0
              + scaleDownDelaySecondsAfterScaleOut = 3600
              + scaleTargetRef                     = {
                  + kind = (known after apply)
                  + name = "runner-wyrihaximus-terraform"
                }
              + scaleUpTriggers                    = (known after apply)
              + scheduledOverrides                 = (known after apply)
            }
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["tf"] will be destroyed
  - resource "kubernetes_manifest" "runner_deployment_autoscaler" {
      - manifest = {
          - apiVersion = "actions.summerwind.dev/v1alpha1"
          - kind       = "HorizontalRunnerAutoscaler"
          - metadata   = {
              - labels    = {
                  - repository = "terraform"
                  - type       = "user"
                  - user       = "wyrihaximus"
                }
              - name      = "runner-wyrihaximus-terraform"
              - namespace = "terraform"
            }
          - spec       = {
              - maxReplicas                        = 1
              - metrics                            = [
                  - {
                      - repositoryNames = [
                          - "wyrihaximus/terraform",
                        ]
                      - type            = "TotalNumberOfQueuedAndInProgressWorkflowRuns"
                    },
                ]
              - minReplicas                        = 0
              - scaleDownDelaySecondsAfterScaleOut = 3600
              - scaleTargetRef                     = {
                  - name = "runner-wyrihaximus-terraform"
                }
            }
        } -> null
      - object   = {
          - apiVersion = "actions.summerwind.dev/v1alpha1"
          - kind       = "HorizontalRunnerAutoscaler"
          - metadata   = {
              - annotations                = null
              - clusterName                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = {
                  - "repository" = "terraform"
                  - "type"       = "user"
                  - "user"       = "wyrihaximus"
                }
              - managedFields              = null
              - name                       = "runner-wyrihaximus-terraform"
              - namespace                  = "terraform"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - spec       = {
              - capacityReservations               = null
              - maxReplicas                        = 1
              - metrics                            = [
                  - {
                      - repositoryNames     = [
                          - "wyrihaximus/terraform",
                        ]
                      - scaleDownAdjustment = null
                      - scaleDownFactor     = null
                      - scaleDownThreshold  = null
                      - scaleUpAdjustment   = null
                      - scaleUpFactor       = null
                      - scaleUpThreshold    = null
                      - type                = "TotalNumberOfQueuedAndInProgressWorkflowRuns"
                    },
                ]
              - minReplicas                        = 0
              - scaleDownDelaySecondsAfterScaleOut = 3600
              - scaleTargetRef                     = {
                  - kind = null
                  - name = "runner-wyrihaximus-terraform"
                }
              - scaleUpTriggers                    = null
              - scheduledOverrides                 = null
            }
        } -> null
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.data.minio_iam_policy_document.policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_document"  {
      ~ id      = "1081301387" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn/*",
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.data.minio_iam_policy_document.policy_global_document will be read during apply
  # (config refers to values not yet known)
 <= data "minio_iam_policy_document" "policy_global_document"  {
      ~ id      = "2744573621" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect    = "Allow" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_policy.policy must be replaced
-/+ resource "minio_iam_policy" "policy" {
      ~ id     = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn",
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_policy.policy_global must be replaced
-/+ resource "minio_iam_policy" "policy_global" {
      ~ id     = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply)
      ~ name   = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b" -> (known after apply) # forces replacement
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetBucketLocation",
                          - "s3:ListAllMyBuckets",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_user_policy_attachment.policy_attachment must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-longhorn-20211110222252604000000006" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.module.minio.minio_iam_user_policy_attachment.policy_attachment_global must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "state-infinity-gauntlet-longhorn-20211110222252578300000005" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 22 to add, 1 to change, 16 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>